SRC/Openfoam_translator/cavity_final_can_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top_surface
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    bottom_surface
    {
        type            noSlip;
    }

    lateral_urface_4
    {
        type            noSlip;
    }
    lateral_surface_3
    {
        type            noSlip;
    }
    lateral_surface_2
    {
        type            noSlip;
    }
    lateral_surface_1
    {
        type            noSlip;
    }

}

// ************************************************************************* //
