SRC/Openfoam_translator/cavity_final_can_run/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top_surface
    {
        type            zeroGradient;
    }

    bottom_surface
    {
        type            zeroGradient;
    }

    lateral_urface_4
    {
        type            zeroGradient;
    }
     lateral_surface_3
    {
        type            zeroGradient;
    }
     lateral_surface_2
    {
        type            zeroGradient;
    }
     lateral_surface_1
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
